Repository: rock-work/project-_trac
Catalog: trac/trac/locale/*/LC_MESSAGES/tracini.po
Languages: it

source: When true, send a `X-Sendfile` header and no content when sending files from the filesystem, so that the web server handles the content. This requires a web server that knows how to handle such a header, like Apache with `mod_xsendfile` or lighttpd. (''since 1.0'')
it: Se impostato a ''true'', restituisci una intestazione `X-Sendfile` senza alcun contenuto quando viene richiesto un file dal filesystem, in modo tale che sia il web server a gestire il contenuto stesso. Questo richiede un web server che sappia gestire questa intestazione, come Apache con `mod_xsendfile` oppure lighttpd. (''dalla 1.0'')

source: The header to use if `use_xsendfile` is enabled. If Nginx is used, set `X-Accel-Redirect`. (''since 1.0.6'')
it: Header da utilizzare se viene abilitata l'opzione `use_xsendfile`. Se si utilizza Nginx, impostare `X-Accel-Redirect`. (''dalla 1.0.6'')

source: Enable/disable highlighting CamelCase links to missing pages.
it: Abilita/disabilita l'evidenziazione dei link CamelCase alle pagine mancanti.

source: Enable/disable splitting the WikiPageNames with space characters.
it: Abilita/disabilita la spezzatura dei WikiPageNames con caratteri di spaziatura.

source: Enable/disable the use of unsafe HTML tags such as `<script>` or `<embed>` with the HTML [wiki:WikiProcessors WikiProcessor]. For public sites where anonymous users can edit the wiki it is recommended to leave this option disabled.
it: Abilita/disabilita l'uso di tag HTML non sicure come `<script>` oppure `<embed>` nel [wiki:WikiProcessors WikiProcessor] HTML. Per siti pubblici dove l'utente anonimo può modificare il wiki si raccomanda di lasciare questa opzione disabilitata.

source: List of URI schemes considered "safe", that will be rendered as external links even if `[wiki] render_unsafe_content` is `false`.
it: Lista di schemi URI considerati "sicuri", che verranno resi come collegamenti esterni anche quando `[wiki] render_unsafe_content` è ''false''.

source: This section configures InterTrac prefixes. Options in this section whose name contain a `.` define aspects of the InterTrac prefix corresponding to the option name up to the `.`. Options whose name don't contain a `.` define an alias. The `.url` is mandatory and is used for locating the other Trac. This can be a relative URL in case that Trac environment is located on the same server. The `.title` information is used for providing a useful tooltip when moving the cursor over an InterTrac link. Example configuration: {{{ [intertrac] # -- Example of setting up an alias: t = trac # -- Link to an external Trac: trac.title = Edgewall's Trac for Trac trac.url = http://trac.edgewall.org }}}
it: Questa sezione configura i prefissi InterTrac. Le opzioni in questa sezione i cui nomi contengano un "." definiscono particolarità del prefisso InterTrac corrispondente al nome dell'opzione fino al ".". Le opzioni il cui nome non contiene un "." definiscono un alias. La chiave `.url` è obbligatoria e viene usata come posizione dell'altro Trac. Può essere un URL relativo nel caso in cui l'altro Trac si trovi sul medesimo server. La chiave `.title` viene usata per mostrare un tooltip quando il cursore viene posizionato sul collegamento InterTrac. Esempio di configurazione: {{{ [intertrac] # -- Esempio di impostazione di un alias: t = trac # -- Collegamento a un Trac esterno: trac.title = Edgewall's Trac for Trac trac.url = http://trac.edgewall.org }}}

source: Every option in the `[interwiki]` section defines one InterWiki prefix. The option name defines the prefix. The option value defines the URL, optionally followed by a description separated from the URL by whitespace. Parametric URLs are supported as well. '''Example:''' {{{ [interwiki] MeatBall = http://www.usemod.com/cgi-bin/mb.pl? PEP = http://www.python.org/peps/pep-$1.html Python Enhancement Proposal $1 tsvn = tsvn: Interact with TortoiseSvn }}}
it: Ogni opzione nella sezione `[interwiki]` definisce un prefisso InterWiki. Il nome dell'opzione definisce il prefisso, mentre il suo valore definisce l'URL, opzionalmente seguito da una descrizione separata da una spaziatura dall'URL. Sono supportati anche URL parametrici. '''Esempio:''' {{{ [interwiki] MeatBall = http://www.usemod.com/cgi-bin/mb.pl? PEP = http://www.python.org/peps/pep-$1.html Python Enhancement Proposal $1 tsvn = tsvn: Interact with TortoiseSvn }}}

source: Maximum allowed wiki page size in characters.
it: Dimensione massima consentita di una pagina wiki, in caratteri.

source: Default height of the textarea on the wiki edit page. (//Since 1.1.5//)
it: Altezza di default della textarea usata per modificare una pagina wiki. (''dalla 1.1.5'')
