Repository: rock-work/project-_trac
Catalog: trac/trac/locale/*/LC_MESSAGES/tracini.po
Languages: it

source: Location of authz policy configuration file. Non-absolute paths are relative to the Environment `conf` directory.
it: Percorso del file di configurazione della policy authz. I percorsi non assoluti sono relativi alla directory `conf` dell'ambiente.

source: This section provides a way to add arbitrary permissions to a Trac environment. This can be useful for adding new permissions to use for workflow actions, for example. To add new permissions, create a new section `[extra-permissions]` in your `trac.ini`. Every entry in that section defines a meta-permission and a comma-separated list of permissions. For example: {{{ [extra-permissions] EXTRA_ADMIN = EXTRA_VIEW, EXTRA_MODIFY, EXTRA_DELETE }}} This entry will define three new permissions `EXTRA_VIEW`, `EXTRA_MODIFY` and `EXTRA_DELETE`, as well as a meta-permissions `EXTRA_ADMIN` that grants all three permissions. The permissions are created in upper-case characters regardless of the casing of the definitions in `trac.ini`. For example, the definition `extra_view` would create the permission `EXTRA_VIEW`. If you don't want a meta-permission, start the meta-name with an underscore (`_`): {{{ [extra-permissions] _perms = EXTRA_VIEW, EXTRA_MODIFY }}}
it: Questa sezione consente di aggiungere permessi arbitrari a un ambiente Trac. Può essere utile ad esempio per aggiungere dei permessi utilizzabili nelle azioni del flusso di lavoro. Per aggiungere un nuovo permesso, crea una nuova sezione `[extra-permissions]` nel file `trac.ini`. Ogni voce in questa sezione definisce un meta-permesso e una lista di permessi separati da virgole. Ad esempio: {{{ [extra-permissions] EXTRA_ADMIN = EXTRA_VIEW, EXTRA_MODIFY, EXTRA_DELETE }}} definisce tre nuovi permessi `EXTRA_VIEW`, `EXTRA_MODIFY` e `EXTRA_DELETE`, oltre che al meta-permesso `EXTRA_ADMIN` che include tutti e tre i permessi. I permessi vengono creati usando caratteri maiuscoli a prescindere dall'effettiva definizione nel `trac.ini`. Ad esempio, la definizione `extra_view` creerebbe il permesso `EXTRA_VIEW`. Se non desideri avere il meta-permesso, aggiungi un underscore (`_`) all'inizio del nome: {{{ [extra-permissions] _perms = EXTRA_VIEW, EXTRA_MODIFY }}}

source: Require commands to be enclosed in an envelope. Must be empty or contain two characters. For example, if set to `[]`, then commands must be in the form of `[closes #4]`.
it: Specifica se i comandi debbano essere delimitati. Deve essere o vuota oppure contenere due caratteri. Ad esempio, se viene impostata a `[]`, i comandi dovranno essere nella forma `[chiude #4]`.

source: Commands that close tickets, as a space-separated list.
it: Comandi che chiudono le segnalazioni, indicate come lista di ID separati da spazi.

source: Commands that add a reference, as a space-separated list. If set to the special value `<ALL>`, all tickets referenced by the message will get a reference to the changeset.
it: Comandi per aggiungere un riferimento, come lista separata da spazi. Se impostato al valore speciale `<ALL>`, tutte le segnalazioni referenziate nel messaggio verranno relazionate al changeset.

source: Check that the committer has permission to perform the requested operations on the referenced tickets. This requires that the user names be the same for Trac and repository operations.
it: Verifica che l'autore del commit abbia il permesso di eseguire l'azione richiesta sulle segnalazioni referenziate. Questo necessita che i nomi utente di Trac e del repository corrispondano.

source: Send ticket change notification when updating a ticket.
it: Invia una notifica di modifica della segnalazione quando viene aggiornata.

source: Enable persistent caching of commit tree.
it: Abilita una cache persistente del contenuto del repository.

source: Wrap `GitRepository` in `CachedRepository`.
it: Accedi al `GitRepository` usando un `CachedRepository`.

source: The length at which a sha1 should be abbreviated to (must be >= 4 and <= 40).
it: La lunghezza a cui troncare i codici sha1 (deve essere >= 4 e <= 40).

source: The minimum length of an hex-string for which auto-detection as sha1 is performed (must be >= 4 and <= 40).
it: La lunghezza minima di una stringa esadecimale perché venga riconosciuta come un codice sha1 (deve essere >= 4 e <= 40).

source: Enable reverse mapping of git email addresses to trac user ids. Performance will be reduced if there are many users and the `cached_repository` option is `disabled`. A repository resync is required after changing the value of this option.
it: Abilita la mappatura inversa degli indirizzi email git verso gli id degli utenti Trac. Le performance potranno risultare ridotte quando vi siano molti utenti e l'opzione `cached_repository` è `disattivata`. Modificando questa opzione rende necessaria una risincronizzazione del repository.

source: Use git-committer id instead of git-author id for the changeset ''Author'' field.
it: Usa il valore di git-committer invece che di git-author per il campo ''Author'' dei changeset.

source: Use git-committer timestamp instead of git-author timestamp for the changeset ''Timestamp'' field.
it: Usa l'istante specificato da git-committer invece che quello specificato da git-author per il campo ''Timestamp'' dei changeset.

source: Define charset encoding of paths within git repositories.
it: Specifica la codifica dei percorsi dei repository git.

source: Path to the git executable.
it: Percorso dell'eseguibile git.

source: Path to a gitweb-formatted projects.list
it: Percorso del file projects.list nel formato gitweb.

source: Path to the base of your git projects
it: Percorso base dei tuoi repository git.

source: Template for project URLs. %s will be replaced with the repo name
it: Template per gli URL dei progetti. %s verrà sostituito con il nome del repository.

source: Comma separated list of paths categorized as branches. If a path ends with '*', then all the directory entries found below that path will be included. Example: `/trunk, /branches/*, /projectAlpha/trunk, /sandbox/*`
it: Lista dei percorsi classificati come branch, separati da virgole. Se un percorso termina con '*', allora tutte le directory trovate sotto quel percorso verranno incluse. Esempio: `/trunk, /branches/*, /progettoAlfa/trunk, /sandbox/*`

source: Comma separated list of paths categorized as tags. If a path ends with '*', then all the directory entries found below that path will be included. Example: `/tags/*, /projectAlpha/tags/A-1.0, /projectAlpha/tags/A-v1.1`
it: Lista dei percorsi classificati come tag, separati da virgole. Se un percorso termina con '*', allora tutte le directory trovate sotto quel percorso verranno incluse. Esempio: `/tags/*, /progettoAlfa/tags/*, /progettoAlfa/tags/A-v1.1`

source: End-of-Line character sequences when `svn:eol-style` property is `native`. If `native`, substitute with the native EOL marker on the server. Otherwise, if `LF`, `CRLF` or `CR`, substitute with the specified EOL marker. (''since 1.0.2'')
it: Sequenza di caratteri per il fine-riga quando la proprietà `svn:eol-style` è `native`. Se `native`, sostituisci con il marcatore EOL nativo sul server. Altrimenti, se `LF`, `CRLF` o `CR`, sostituisci con il marker EOL specificato. (''dalla 1.0.2'')

source: The TracBrowser for Subversion can interpret the `svn:externals` property of folders. By default, it only turns the URLs into links as Trac can't browse remote repositories. However, if you have another Trac instance (or an other repository browser like [http://www.viewvc.org/ ViewVC]) configured to browse the target repository, then you can instruct Trac which other repository browser to use for which external URL. This mapping is done in the `[svn:externals]` section of the TracIni. Example: {{{ [svn:externals] 1 = svn://server/repos1 http://trac/proj1/browser/$path?rev=$rev 2 = svn://server/repos2 http://trac/proj2/browser/$path?rev=$rev 3 = http://theirserver.org/svn/eng-soft http://ourserver/viewvc/svn/$path/?pathrev=25914 4 = svn://anotherserver.com/tools_repository http://ourserver/tracs/tools/browser/$path?rev=$rev }}} With the above, the `svn://anotherserver.com/tools_repository/tags/1.1/tools` external will be mapped to `http://ourserver/tracs/tools/browser/tags/1.1/tools?rev=` (and `rev` will be set to the appropriate revision number if the external additionally specifies a revision, see the [http://svnbook.red-bean.com/en/1.4/svn.advanced.externals.html SVN Book on externals] for more details). Note that the number used as a key in the above section is purely used as a place holder, as the URLs themselves can't be used as a key due to various limitations in the configuration file parser. Finally, the relative URLs introduced in [http://subversion.apache.org/docs/release-notes/1.5.html#externals Subversion 1.5] are not yet supported.
it: Il TracBrowser per Subversion può interpretare le proprietà `svn:externals` sulle cartelle. Di default, si limita a convertire gli URL in collegamenti, dal momento che Trac non può accedere ai repository remoti. D'altro canto, se hai un altro ambiente Trac (oppure un altro visualizzatore di repository tipo [http://www.viewvc.org/ ViewVC]) configurato per accedere al repository remoto, puoi specificare a Trac quale visualizzatore utilizzare per un certo URL esterno. Questa mappatura viene determinata nella sezione `[svn:externals]` del TracIni. Esempio: {{{ [svn:externals] 1 = svn://server/repos1 http://trac/proj1/browser/$path?rev=$rev 2 = svn://server/repos2 http://trac/proj2/browser/$path?rev=$rev 3 = http://theirserver.org/svn/eng-soft http://ourserver/viewvc/svn/$path/?pathrev=25914 4 = svn://anotherserver.com/tools_repository http://ourserver/tracs/tools/browser/$path?rev=$rev }}} Con questa configurazione, il riferimento esterno `svn://anotherserver.com/tools_repository/tags/1.1/tools` verrà rediretto a `http://ourserver/tracs/tools/browser/tags/1.1/tools?rev=` (e `rev` verrà impostato al numero di revisione del caso se il riferimento esterno specifica una revisione, vedi [http://svnbook.red-bean.com/en/1.4/svn.advanced.externals.html SVN Book on externals] per ulteriori dettagli). Nota che il numero usato come chiave nella sezione qui sopra viene semplicemente ignorato, ed è necessario solo perché per varie limitazioni nel parser del file di configurazione non è possibile usare l'URL stesso come chiave. Infine, gli URL relativi introdotti nella versione [http://subversion.apache.org/docs/release-notes/1.5.html#externals Subversion 1.5] non sono ancora supportati.

source: Maximum allowed file size (in bytes) for attachments.
it: Dimensione massima consentita (in byte) per gli allegati.

source: Maximum allowed total size (in bytes) for an attachment list to be downloadable as a `.zip`. Set this to -1 to disable download as `.zip`. (''since 1.0'')
it: Dimensione massima consentita (in byte) della lista di allegati per essere scaricabile come `.zip`. Imposta a -1 per disabilitare lo scaricamento come `.zip`. (''dalla 1.0'')

source: Whether attachments should be rendered in the browser, or only made downloadable. Pretty much any file may be interpreted as HTML by the browser, which allows a malicious user to attach a file containing cross-site scripting attacks. For public sites where anonymous users can create attachments it is recommended to leave this option disabled.
it: Se i file allegati debbano essere visualizzati nel browser, piuttosto che solo tramite scaricamento. Dal momento che praticamente qualsiasi file può essere interpretato come HTML dal browser, un malintenzionato potrebbe allegare un file contenente uno script che implementa un attacco "cross-site". Per siti pubblici dove utenti anonimi possono allegare un file, si raccomanda di lasciare questa opzione disabilitata.<

source: This section is used to enable or disable components provided by plugins, as well as by Trac itself. The component to enable/disable is specified via the name of the option. Whether its enabled is determined by the option value; setting the value to `enabled` or `on` will enable the component, any other value (typically `disabled` or `off`) will disable the component. The option name is either the fully qualified name of the components or the module/package prefix of the component. The former enables/disables a specific component, while the latter enables/disables any component in the specified package/module. Consider the following configuration snippet: {{{ [components] trac.ticket.report.ReportModule = disabled acct_mgr.* = enabled }}} The first option tells Trac to disable the [wiki:TracReports report module]. The second option instructs Trac to enable all components in the `acct_mgr` package. Note that the trailing wildcard is required for module/package matching. To view the list of active components, go to the ''Plugins'' page on ''About Trac'' (requires `CONFIG_VIEW` [wiki:TracPermissions permissions]). See also: TracPlugins
it: Questa sezione è usata per abilitare o disabilitare sia i componenti forniti dai plugin che quelli di Trac stesso. Il componente da abilitare/disabilitare viene specificato dal nome dell'opzione. Il suo valore determina lo stato di attivazione: `enabled` oppure `on` per attivarlo, qualsiasi altro valore (tipicamente `disabled` o `off`) per disabilitarlo. Il nome dell'opzione può essere sia il nome completo del componente piuttosto che il prefisso del modulo/package del componente. La prima forma abilita/disabilita uno specifico componente, mentre la seconda abilita/disabilita qualsiasi componente fornito dal modulo/package specificato. Considera la seguente configurazione: {{{ [components] trac.ticket.report.ReportModule = disabled acct_mgr.* = enabled }}} La prima opzione indica a Trac di disabilitare il [wiki:TracReports modulo report]. La seconda opzione invece abilita tutti i componenti del package `acct_mgr`. Nota come il suffisso `*` sia necessario per individuare i componenti del modulo/package. Per vedere la lista dei componenti attivi, consulta la sezione ''Moduli aggiuntivi installati'' nella pagina ''Info su Trac'' (richiede il [wiki:TracPermissions permesso] `CONFIG_VIEW`). Vedi anche: TracPlugins

source: Path to the //shared plugins directory//. Plugins in that directory are loaded in addition to those in the directory of the environment `plugins`, with this one taking precedence.
it: Percorso della //directory condivisa dei plugin//. I plugin in questa directory sono caricati in aggiunta a quelli nella directory `plugins` dell'ambiente, che hanno comunque precedenza.

source: Reference URL for the Trac deployment. This is the base URL that will be used when producing documents that will be used outside of the web browsing context, like for example when inserting URLs pointing to Trac resources in notification e-mails.
it: URL di riferimento dell'ambiente Trac. Si tratta dell'URL di base che verrà usato nella produzione di documenti usati fuori dall'usuale contesto web, come ad esempio quando vengono inseriti URL che puntano a determinate risorse di Trac nelle notifiche via email.

source: Optionally use `[trac] base_url` for redirects. In some configurations, usually involving running Trac behind a HTTP proxy, Trac can't automatically reconstruct the URL that is used to access it. You may need to use this option to force Trac to use the `base_url` setting also for redirects. This introduces the obvious limitation that this environment will only be usable when accessible from that URL, as redirects are frequently used.
it: Utilizza `[trac] base_url` per le redirezioni. In qualche configurazione, tipicamente quando Trac viene esposto tramite un proxy HTTP, Trac non è in grado di ricostruire automaticamente l'URL usato per accedervi. Potresti dover usare questa opzione per forzare il Trac a usare l'impostazione `base_url` anche per le redirezioni. Questo ovviamente implica che l'ambiente potrà essere usato solo quando vi si accede da quella URL, dal momento che le redirezioni vengono usate di frequente.

source: Restrict cookies to HTTPS connections. When true, set the `secure` flag on all cookies so that they are only sent to the server on HTTPS connections. Use this if your Trac instance is only accessible through HTTPS.
it: Limita i cookie alle connessioni HTTPS. Quando impostato a ''true'', abilita la flag `secure` su tutti i cookie in modo tale che vengano spediti al server solo tramite connessioni HTTPS. Usa questa opzione solo quando l'istanza Trac sia accessibile solo tramite HTTPS.

source: Name of the project.
it: Nome del progetto.

source: Short description of the project.
it: Breve descrizione del progetto.

source: URL of the main project web site, usually the website in which the `base_url` resides. This is used in notification e-mails.
it: URL del sito web del progetto principale, solitamente il sito dove risiede `base_url`. Viene usato nelle notifiche via email.

source: E-Mail address of the project's administrator.
it: Indirizzo email dell'amministratore del progetto.

source: Base URL of a Trac instance where errors in this Trac should be reported. This can be an absolute or relative URL, or '.' to reference this Trac instance. An empty value will disable the reporting buttons.
it: URL di base dell'istanza Trac dove riportare gli errori che avvengono in questo Trac. Può essere un URL assoluto o relativo, oppure '.' per riferirsi a questa istanza Trac. Specificare un valore vuoto per disabilitare i pulsanti relativi.

source: Page footer text (right-aligned).
it: Testo usato come piè di pagina (allineato a destra).

source: URL of the icon of the project.
it: URL dell'icona del progetto.

source: Logging facility to use. Should be one of (`none`, `file`, `stderr`, `syslog`, `winlog`).
it: Tipo di logging utilizzato. Valori consentiti: `none`, `file`, `stderr`, `syslog` o `winlog`.

source: If `log_type` is `file`, this should be a path to the log-file. Relative paths are resolved relative to the `log` directory of the environment.
it: Se `log_type` è `file`, questo deve essere il percorso del file di log. Se il percorso è relativo, viene risolto rispetto alla directory `log` dell'ambiente.

source: Level of verbosity in log. Should be one of (`CRITICAL`, `ERROR`, `WARNING`, `INFO`, `DEBUG`).
it: Livello di logging. Valori consentiti: `CRITICAL`, `ERROR`, `WARN`, `INFO` o `DEBUG`.

source: Custom logging format. If nothing is set, the following will be used: `Trac[$(module)s] $(levelname)s: $(message)s` In addition to regular key names supported by the [http://docs.python.org/library/logging.html Python logger library] one could use: - `$(path)s` the path for the current environment - `$(basename)s` the last path component of the current environment - `$(project)s` the project name Note the usage of `$(...)s` instead of `%(...)s` as the latter form would be interpreted by the !ConfigParser itself. Example: `($(thread)d) Trac[$(basename)s:$(module)s] $(levelname)s: $(message)s`
it: Personalizzazione del formato di logging. Se non viene impostato, verrà usato il seguente formato: Trac[$(module)s] $(levelname)s: $(message)s Oltre alle chiavi ordinariamente supportate dalla libreria logging di Python (vedi http://docs.python.org/library/logging.html), possono essere usati anche: - `$(path)s` il path dell'ambiente corrente - `$(basename)s` l'ultima componente del path dell'ambiente corrente - `$(project)s` il nome del progetto Da notare l'utilizzo della forma `$(...)s` al posto di `%(...)s` dal momento che quest'ultima forma verrebbe interpretata immediatamente dal !ConfigParser stesso. Esempio: `($(thread)d) Trac[$(basename)s:$(module)s] $(levelname)s: $(message)s`

source: Name of the component implementing `IPermissionStore`, which is used for managing user and group permissions.
it: Nome del componente che implementa `IPermissionStore`, usato per gestire i permessi degli utenti e dei gruppi.

source: List of components implementing `IPermissionPolicy`, in the order in which they will be applied. These components manage fine-grained access control to Trac resources.
it: Lista di componenti che implementano `IPermissionPolicy`, nell'ordine in cui verranno applicati. Questi componenti gestiscono il controllo di accesso fine alle risorse di Trac.

source: Database connection [wiki:TracEnvironment#DatabaseConnectionStrings string] for this project
it: Connessione al database. [wiki:TracEnvironment#DatabaseConnectionStrings Stringa] di connessione al database per questo progetto.

source: Database backup location
it: Posizione del backup del database.

source: Timeout value for database connection, in seconds. Use '0' to specify ''no timeout''.
it: Valore di timeout per la connessione al database, in secondi. Usare `0` per specificare ''nessun timeout''.

source: Show the SQL queries in the Trac log, at DEBUG level.
it: Mostra le query SQL nel log di Trac, al livello DEBUG.

source: Location of mysqldump for MySQL database backups
it: Percorso di mysqldump per effettuare i backup dei database MySQL.

source: Location of pg_dump for Postgres database backups
it: Percorso di pg_dump per effettuare i backup dei database PostgreSQL.

source: Paths to sqlite extensions, relative to Trac environment's directory or absolute. (''since 0.12'')
it: Percorsi alle estensioni sqlite, sia relativi alla directory dell'ambiente Trac oppure assoluti. (''dalla 0.12'')

source: Charset to be used when in doubt.
it: Codifica da usare in caso di ambiguità.

source: Displayed tab width in file preview.
it: Larghezza del tab nella visualizzazione dei file.

source: Maximum file size for HTML preview.
it: Dimensione massima del file per la visualizzazione HTML.

source: List of additional MIME types and keyword mappings. Mappings are comma-separated, and for each MIME type, there's a colon (":") separated list of associated keywords or file extensions.
it: Lista di tipi MIME addizionali e mappature di keyword Le mappature sono separate da virgole e per ciascun tipo MIME viene specificata una lista di parole chiave o di estensioni di file separate dal carattere due punti (`:`).

source: List of additional MIME types associated to filename patterns. Mappings are comma-separated, and each mapping consists of a MIME type and a Python regexp used for matching filenames, separated by a colon (":"). (''since 1.0'')
it: Lista di tipi MIME associati a pattern di filename. Le mappature sono separate da virgole, e ciascuna consiste in un tipo MIME e una espressione regolare Python usata per verificare i filename, separati da un carattere due punti (`:`). (''dalla 1.0'')

source: Comma-separated list of MIME types that should be treated as binary data.
it: Lista di tipi MIME separati da virgole che devono essere considerati come dati binari.

source: Configure Pygments [%(url)s lexer] options. For example, to set the [%(url)s#lexers-for-php-and-related-languages PhpLexer] options `startinline` and `funcnamehighlighting`: {{{#!ini [pygments-lexer] php.startinline = True php.funcnamehighlighting = True }}} The lexer name is derived from the class name, with `Lexer` stripped from the end. The lexer //short names// can also be used in place of the lexer name. urlhttp://pygments.org/docs/lexers/
it: Opzioni di configurazione del [http://pygments.org/docs/lexers/ lexer] di Pygments. Ad esempio, per impostare le opzioni `startinline` e `funcnamehighlighting` di [http://pygments.org/docs/lexers/#lexers-for-php-and-related-languages PhpLexer]: {{{#!ini [pygments-lexer] php.startinline = True php.funcnamehighlighting = True }}} Il nome del lexer è derivato dal nome della classe, eliminando `Lexer` dalla fine del nome. Possono essere usate anche le //abbreviazioni// (//short names//) del lexer invece che il suo nome completo.

source: The default style to use for Pygments syntax highlighting.
it: Stile di default utilizzato da Pygments.
