Repository: rock-work/project-_trac
Catalog: trac/trac/locale/*/LC_MESSAGES/tracini.po
Languages: it

source: One of the alternatives for registering new repositories is to populate the `[repositories]` section of the `trac.ini`. This is especially suited for setting up convenience aliases, short-lived repositories, or during the initial phases of an installation. See [TracRepositoryAdmin#Intrac.ini TracRepositoryAdmin] for details about the format adopted for this section and the rest of that page for the other alternatives. (''since 0.12'')
it: Una delle alternative per registrare nuovi repository è quella di popolare la sezione `[repositories]` del `trac.ini`. Si tratta di un'opzione particolarmente adatta per impostare un adeguato alias, o per repository dalla vita breve, o ancora durante le fasi iniziali di una installazione. Consulta [TracRepositoryAdmin#Intrac.ini TracRepositoryAdmin] per i dettagli sul formato di questa sezione, e il resto della pagina per le altre alternative. (''dalla 0.12'')

source: Default repository connector type. This is used as the default repository type for repositories defined in the [[TracIni#repositories-section repositories]] section or using the "Repositories" admin panel. (''since 0.12'')
it: Tipo di repository di default. Viene usato come tipo di repository di default per i repository definiti nella sezione [TracIni#repositories-section repositories] o nel pannello di amministrazione "Repository". (''dalla 0.12'')

source: The path to the Subversion [http://svnbook.red-bean.com/en/1.6/svn.serverconfig.pathbasedauthz.html authorization (authz) file]. To enable authz permission checking, the `AuthzSourcePolicy` permission policy must be added to `[trac] permission_policies`. Non-absolute paths are relative to the Environment `conf` directory.
it: Percorso del [http://svnbook.red-bean.com/en/1.6/svn.serverconfig.pathbasedauthz.html file di autorizzazione (authz)] di Subversion. Per abilitare il controllo dei permessi authz, la policy `AuthzSourcePolicy` deve essere aggiunta a `[trac] permission_policies`. I percorsi non assoluti sono relativi alla directory `conf` dell'ambiente.

source: The module prefix used in the `authz_file` for the default repository. If left empty, the global section is used.
it: Il prefisso del modulo usato da `authz_file` per il repository di default. Se lasciato in bianco, viene usata la sezione globale.

source: Comma-separated list of version control properties to render as wiki content in the repository browser.
it: Lista di proprietà del sistema di versionamento, separate da virgole, da mostrare come contenuto wiki nel visualizzatore del repository.

source: Comma-separated list of version control properties to render as oneliner wiki content in the repository browser.
it: Lista di proprietà del sistema di versionamento, separate da virgole, da mostrare come contenuto wiki a singola riga nel visualizzatore del repository.

source: List of repository paths that can be downloaded. Leave this option empty if you want to disable all downloads, otherwise set it to a comma-separated list of authorized paths (those paths are glob patterns, i.e. "*" can be used as a wild card). In a multi-repository environment, the path must be qualified with the repository name if the path does not point to the default repository (e.g. /reponame/trunk). Note that a simple prefix matching is performed on the paths, so aliases won't get automatically resolved.
it: Lista dei percorsi del repository che possono essere scaricati. Lascia questa opzione vuota se vuoi disabilitare la funzionalità, altrimenti impostala a una lista di percorsi consentiti (vengono interpretati come pattern glob, cioè "*" può essere usato come jolly), separati da virgole. In un ambiente multi-repository il percorso deve essere qualificato con il nome del repository se non si riferisce al repository di default (ad esempio /nomerepo/trunk). Nota che viene applicata una semplice verifica del prefisso, quindi gli eventuali alias non vengono considerati automaticamente.

source: Enable colorization of the ''age'' column. This uses the same color scale as the source code annotation: blue is older, red is newer.
it: Abilita la colorazione della colonna ''età''. Viene utilizzata la stessa scala di colori usata nelle visualizzazione delle annotazioni del codice sorgente: il blu indica cose più vecchie, il rosso cose recenti.

source: (r,g,b) color triple to use for the color corresponding to the newest color, for the color scale used in ''blame'' or the browser ''age'' column if `color_scale` is enabled.
it: Tripla (r,g,b) per indicare il colore usato per le cose più recenti, nella scala colori usata nelle ''annotazioni'' o nella colonna ''età'' se l'opzione `color_scale` è abilitata.

source: (r,g,b) color triple to use for the color corresponding to the oldest color, for the color scale used in ''blame'' or the browser ''age'' column if `color_scale` is enabled.
it: Tripla (r,g,b) per indicare il colore usato le cose più vecchie, nella scala colori usata nelle ''annotazioni'' o nella colonna ''età'' se l'opzione `color_scale` è abilitata.

source: If set to a value between 0 and 1 (exclusive), this will be the point chosen to set the `intermediate_color` for interpolating the color value.
it: Se impostato a un valore tra 0 e 1 (esclusi), verrà usato per stabilire l'`intermediate_color` nell'interpolazione del colore.

source: (r,g,b) color triple to use for the color corresponding to the intermediate color, if two linear interpolations are used for the color scale (see `intermediate_point`). If not set, the intermediate color between `oldest_color` and `newest_color` will be used.
it: Tripla (r,g,b) per indicare il colore intermedio, quando vengono usate due interpolazioni lineari per stabilire la scala di colori (vedi `intermediate_color`). Se non viene impostata, verrà usato il colore intermedio tra `oldest_color` e `newest_color`.

source: Whether raw files should be rendered in the browser, or only made downloadable. Pretty much any file may be interpreted as HTML by the browser, which allows a malicious user to create a file containing cross-site scripting attacks. For open repositories where anyone can check-in a file, it is recommended to leave this option disabled.
it: Se i file grezzi debbano essere visualizzati nel browser, piuttosto che solo tramite scaricamento. Dal momento che praticamente qualsiasi file può essere interpretato come HTML dal browser, un malintenzionato potrebbe creare un file contenente uno script che implementa un attacco "cross-site". Per repository aperti dove chiunque può inserire un file, si raccomanda di lasciare questa opzione disabilitata.

source: Comma-separated list of version control properties to hide from the repository browser.
it: Lista di proprietà del sistema di versionamento, separate da virgole, che devono essere nascoste dal visualizzatore del repository.

source: Number of files to show (`-1` for unlimited, `0` to disable). This can also be `location`, for showing the common prefix for the changed files.
it: Numero di file da visualizzare (`-1` per illimitato, `0` per disabilitare). Può essere impostato anche a `location`, per mostrare il prefisso comune tra i file modificati.

source: Whether wiki-formatted changeset messages should be multiline or not. If this option is not specified or is false and `wiki_format_messages` is set to true, changeset messages will be single line only, losing some formatting (bullet points, etc).
it: Se la formattazione wiki dei messaggi nei changeset debba essere multi-riga oppure no. Se questa opzione non è specificata o è ''false'' e `wiki_format_messages` è impostata a ''true'', i messaggi nei changeset saranno mostrati come singole riga, perdendo qualche formattazione (liste puntate, ecc.)

source: Whether consecutive changesets from the same author having exactly the same message should be presented as one event. That event will link to the range of changesets in the log view.
it: Se changeset consecutivi dello stesso autore aventi esattamente lo stesso messaggio debbano essere presentati come un singolo evento. In questo caso l'evento punterà a un intervallo di changeset nella vista cronologica.

source: Maximum number of modified files for which the changeset view will attempt to show the diffs inlined.
it: Numero massimo di file modificati per cui la vista del changeset cercherà di mostrare le differenze in linea.

source: Maximum total size in bytes of the modified files (their old size plus their new size) for which the changeset view will attempt to show the diffs inlined.
it: Dimensione massima totale in byte dei file modificati (dimensione precedente più dimensione attuale) per cui la vista del changeset cercherà di mostrare le differenze in linea.

source: Whether wiki formatting should be applied to changeset messages. If this option is disabled, changeset messages will be rendered as pre-formatted text.
it: Se i messaggi nei changeset debbano essere interpretati come formattazione wiki. Se questa opzione è disabilitata, i messaggi nei changeset verranno mostrati come testo preformattato.

source: Default value for the limit argument in the TracRevisionLog.
it: Valore di default del parametro `limit` nel TracRevisionLog.

source: Comma-separated list of colors to use for the TracRevisionLog graph display. (''since 1.0'')
it: Lista di colori, separati da virgole, usata nel grafo visualizzato nel TracRevisionLog. (''dalla 1.0'')

source: Whether the IP address of the user should be checked for authentication.
it: Se l'indirizzo IP dell'utente debba essere verificato per l'autenticazione.

source: Whether login names should be converted to lower case.
it: Se i nomi degli utenti debbano essere convertiti in minuscolo.

source: Lifetime of the authentication cookie, in seconds. This value determines how long the browser will cache authentication information, and therefore, after how much inactivity a user will have to log in again. The value of 0 makes the cookie expire at the end of the browsing session. (''since 0.12'')
it: Intervallo di validità del cookie di autenticazione, in secondi. Questo valore determina quanto a lungo il browser manterrà memoria delle informazioni di autenticazione, quindi la durata dell'inattività dell'utente prima che gli venga richiesta nuovamente l'autenticazione. Il valore di default 0 fa scadere il cookie alla fine della sessione del browser. (''dalla 0.12'')

source: Path for the authentication cookie. Set this to the common base path of several Trac instances if you want them to share the cookie. (''since 0.12'')
it: Percorso del cookie di autenticazione. Imposta questo al percorso di base comune a diverse istanze Trac se vuoi che condividano il medesimo cookie. (''dalla 0.12'')

source: Path to the //shared templates directory//. Templates in that directory are loaded in addition to those in the environments `templates` directory, but the latter take precedence.
it: Percorso della //directory dei template condivisi//. I template in questa directory vengono caricati in aggiunta a quelli presenti nella directory `templates` dell'ambiente, sebbene questi ultimi abbiano la precedenza.

source: Path to the //shared htdocs directory//. Static resources in that directory are mapped to /chrome/shared under the environment URL, in addition to common and site locations. This can be useful in site.html for common interface customization of multiple Trac environments. (''since 1.0'')
it: Percorso della //directory htdocs condivisa//. Le risorse statiche in questa directory vengono mappate da /chrome/shared nell'URL dell'ambiente, in aggiunta alle locazioni common e site. Questo può essere utile nel site.html per avere una personalizzazione comune dell'interfaccia di ambienti Trac multipli. (''dalla 1.0'')

source: Automatically reload template files after modification.
it: Ricarica automaticamente i template modificati.

source: The maximum number of templates that the template loader will cache in memory. You may want to choose a higher value if your site uses a larger number of templates, and you have enough memory to spare, or you can reduce it if you are short on memory.
it: Numero massimo di template di cui caricatore di template manterrà una cache in memoria. Puoi usare un valore più elevato se il tuo sito utilizza un gran numero di template e se hai memoria sufficiente, oppure puoi ridurlo se hai poca memoria.

source: Base URL for serving the core static resources below `/chrome/common/`. It can be left empty, and Trac will simply serve those resources itself. Advanced users can use this together with [TracAdmin trac-admin ... deploy <deploydir>] to allow serving the static resources for Trac directly from the web server. Note however that this only applies to the `<deploydir>/htdocs/common` directory, the other deployed resources (i.e. those from plugins) will not be made available this way and additional rewrite rules will be needed in the web server.
it: URL di base per service le risorse statiche sotto /chrome/common. Può essere lasciato vuoto, nel qual caso Trac semplicemente servirà tali risorse autonomamente. Utenti esperti potranno usare questa opzione insieme a [TracAdmin trac-admin ... deploy <deploydir>] per consentire al web server di servire direttamente le risorse statiche. Nota però che questo si applica solo alla directory `<deploydir>/htdocs/common`, mentre le altre risorse (cioè quelle fornite dai plugin) non vengono fornite in questo modo e saranno necessarie ulteriori regole di rewrite sul web server.

source: Location of the jQuery !JavaScript library (version 1.8.3). An empty value loads jQuery from the copy bundled with Trac. Alternatively, jQuery could be loaded from a CDN, for example: http://code.jquery.com/jquery-1.8.3.min.js, http://ajax.aspnetcdn.com/ajax/jQuery/jquery-1.8.3.min.js or https://ajax.googleapis.com/ajax/libs/jquery/1.8.3/jquery.min.js. (''since 1.0'')
it: Posizione della libreria !JavaScript di jQuery (versione 1.8.3). Un valore vuoto carica jQuery dalla copia inclusa con Trac. In alternativa, jQuery può essere caricata da una CDN, ad esempio: http://code.jquery.com/jquery-1.8.3.min.js, http://ajax.aspnetcdn.com/ajax/jQuery/jquery-1.8.3.min.js oppure https://ajax.googleapis.com/ajax/libs/jquery/1.8.3/jquery.min.js. (''dalla 1.0'')

source: Location of the jQuery UI !JavaScript library (version 1.9.2). An empty value loads jQuery UI from the copy bundled with Trac. Alternatively, jQuery UI could be loaded from a CDN, for example: https://ajax.googleapis.com/ajax/libs/jqueryui/1.9.2/jquery-ui.min.js or http://ajax.aspnetcdn.com/ajax/jquery.ui/1.9.2/jquery-ui.min.js. (''since 1.0'')
it: Posizione della libreria !JavaScript jQuery UI (version 1.9.2). Un valore vuoto carica jQuery UI dalla copia inclusa con Trac. In alternativa, jQuery UI può essere caricata da una CDN, ad esempio: https://ajax.googleapis.com/ajax/libs/jqueryui/1.9.2/jquery-ui.min.js oppure http://ajax.aspnetcdn.com/ajax/jquery.ui/1.9.2/jquery-ui.min.js. (''dalla 1.0'')

source: Location of the theme to be used with the jQuery UI !JavaScript library (version 1.9.2). An empty value loads the custom Trac jQuery UI theme from the copy bundled with Trac. Alternatively, a jQuery UI theme could be loaded from a CDN, for example: https://ajax.googleapis.com/ajax/libs/jqueryui/1.9.2/themes/start/jquery-ui.css or http://ajax.aspnetcdn.com/ajax/jquery.ui/1.9.2/themes/start/jquery-ui.css. (''since 1.0'')
it: Posizione dei temi usati dalla libreria !JavaScript jQuery UI (version 1.9.2). Un valore vuoto carica il tema jQuery UI personalizzato da Trac dalla copia inclusa con Trac. In alternativa, un tema jQuery UI può essere caricato da una CDN, ad esempio: https://ajax.googleapis.com/ajax/libs/jqueryui/1.9.2/themes/start/jquery-ui.css oppure http://ajax.aspnetcdn.com/ajax/jquery.ui/1.9.2/themes/start/jquery-ui.css. (''dalla 1.0'')

source: Configures the main navigation bar, which by default contains //Wiki//, //Timeline//, //Roadmap//, //Browse Source//, //View Tickets//, //New Ticket//, //Search// and //Admin//. The `label`, `href`, and `order` attributes can be specified. Entries can be disabled by setting the value of the navigation item to `disabled`. The following example renames the link to WikiStart to //Home//, links the //View Tickets// entry to a specific report and disables the //Search// entry. {{{#!ini [mainnav] wiki.label = Home tickets.href = /report/24 search = disabled }}} See TracNavigation for more details.
it: Configura la barra di navigazione principale, che di default contiene //Wiki//, //Cronologia//, //Obiettivi//, //Sorgenti//, //Segnalazioni//, //Nuova segnalazione//, //Cerca// e //Admin//. Possono essere specificati gli attributi `label`, `href`, e `order`. Le singole voci possono essere disabilitate impostando il valore dell'elemento a `disabled`. L'esempio seguente cambia il nome del link WikiStart a //Documentazione//, collega la voce //Segnalazioni// a uno specifico report e disabilita la voce //Cerca//. {{{#!ini [mainnav] wiki.label = Documentazione tickets.href = /report/24 search = disabled }}} Vedi TracNavigation per ulteriori dettagli.

source: Configures the meta navigation entries, which by default are //Login//, //Logout//, //Preferences//, ''!Help/Guide'' and //About Trac//. The allowed attributes are the same as for `[mainnav]`. Additionally, a special entry is supported - `logout.redirect` is the page the user sees after hitting the logout button. For example: {{{#!ini [metanav] logout.redirect = wiki/Logout }}} See TracNavigation for more details.
it: Configura le meta voci di navigazione, che di default sono //Accedi//, //Esci//, //Preferenze//, ''!Aiuto/Guida'' e //Info su Trac//. Gli attributi consentiti sono gli stessi che per `[mainnav]`. Oltre a quelli, è supportata anche un'ulteriore voce speciale: `logout.redirect` è la pagina dove viene rediretto l'utente dopo aver premuto il tasto di uscita. Ad esempio: {{{#!ini [metanav] logout.redirect = wiki/Logout }}} Per ulteriori dettagli consulta TracNavigation.

source: URL to link to, from the header logo.
it: URL per il collegamento associato al logo nell'intestazione.

source: URL of the image to use as header logo. It can be absolute, server relative or relative. If relative, it is relative to one of the `/chrome` locations: `site/your-logo.png` if `your-logo.png` is located in the `htdocs` folder within your TracEnvironment; `common/your-logo.png` if `your-logo.png` is located in the folder mapped to the [#trac-section htdocs_location] URL. Only specifying `your-logo.png` is equivalent to the latter.
it: URL dell'immagine da usare come logo nell'intestazione. Può essere assoluto, relativo al server o relativo. Se è relativo, viene risolto rispetto a una delle posizioni `/chrome`: `site/tuo-logo.png` se `tuo-logo.png` è posizionato nella cartella `htdocs` del TracEnvironment; `common/tuo-logo.png` se `tuo-logo.png` è posizionato nella cartella mappata all'URL [#trac-section htdocs_location]. Specificando solo `tuo-logo.png` è equivalente a quest'ultima opzione.

source: Alternative text for the header logo.
it: Testo alternativo per il logo nell'intestazione.<

source: Width of the header logo image in pixels.
it: Larghezza in pixel dell'immagine del logo nell'intestazione.

source: Height of the header logo image in pixels.
it: Altezza in pixel dell'immagine del logo nell'intestazione.<

source: Show email addresses instead of usernames. If false, email addresses are obfuscated for users that don't have EMAIL_VIEW permission.
it: Mostra gli indirizzi email invece che i nomi utente. Se ''false'', l'indirizzo email viene offuscato per gli utenti che non hanno il permesso EMAIL_VIEW.

source: Show full names instead of usernames. (//since 1.2//)
it: Mostra i nomi completi anziché i nomi utente. (''dalla 1.2'')

source: Never obfuscate `mailto:` links explicitly written in the wiki, even if `show_email_addresses` is false or the user doesn't have EMAIL_VIEW permission.
it: Non offuscare mai i link `mailto:` scritti esplicitamente nel wiki, anche quando `show_email_addresses` è ''false'' oppure l'utente non abbia il permesso EMAIL_VIEW.

source: Show IP addresses for resource edits (e.g. wiki). Since 1.0.5 this option is deprecated and will be removed in 1.3.1.
it: Mostra gli indirizzi IP per la modifica delle risorse (ad esempio le pagine wiki). Questa opzione è deprecata dalla versione 1.0.5 e verrà rimossa nella 1.3.1.

source: Make `<textarea>` fields resizable. Requires !JavaScript. (''since 0.12'')
it: Rendi i campi `<textarea>` ridimensionabili. Richiede !JavaScript. (''dalla 0.12'')

source: Add a simple toolbar on top of Wiki `<textarea>`s. (''since 1.0.2'')
it: Aggiungi una semplice toolbar sopra le `<textarea>` del Wiki. (''dalla 1.0.2'')

source: Inactivity timeout in seconds after which the automatic wiki preview triggers an update. This option can contain floating-point values. The lower the setting, the more requests will be made to the server. Set this to 0 to disable automatic preview. (''since 0.12'')
it: Periodo di inattività in secondi dopo il quale mostrare automaticamente l'anteprima wiki. Il valore può essere un numero in virgola mobile. Più basso è il valore, più frequenti saranno le richieste fatte al server. Impostalo a 0 per disabilitare l'anteprima automatica. (''dalla 0.12'')

source: The date information format. Valid options are 'relative' for displaying relative format and 'absolute' for displaying absolute format. (''since 1.0'')
it: Formato dei valori temporali. Le opzioni possibili sono 'relative' per visualizzarli in un formato relativo oppure 'absolute' per mostrarli in formato assoluto. (''dalla 1.0'')

source: If enabled, send contents as chunked encoding in HTTP/1.1. Otherwise, send contents with `Content-Length` header after entire of the contents are rendered. (''since 1.0.6'')
it: Se abilitato, i contenuti vengono inviati utilizzando la ''chunked encoding''. Altrimenti vengono inviati con l'header `Content-Length` dopo che l'intero contenuto è stato reso. (''dalla 1.0.6'')

source: Ordered list of filters to apply to all requests.
it: Lista ordinata dei filtri da applicare a tutte le richieste.

source: Name of the component that handles requests to the base URL. Options include `TimelineModule`, `RoadmapModule`, `BrowserModule`, `QueryModule`, `ReportModule`, `TicketModule` and `WikiModule`.
it: Nome del componente che gestisce le richieste all'URL di base. Le opzioni possibili sono `TimelineModule`, `RoadmapModule`, `BrowserModule`, `QueryModule`, `ReportModule`, `TicketModule` e `WikiModule`.

source: The default timezone to use
it: Fuso orario da usare di default.

source: The preferred language to use if no user preference has been set. (''since 0.12.1'')
it: La lingua di da utilizzare quando non sia stata impostata quella preferita dell'utente. (''dalla 0.12.1'')

source: The date format. Valid options are 'iso8601' for selecting ISO 8601 format, or leave it empty which means the default date format will be inferred from the browser's default language. (''since 1.0'')
it: Il formato delle date. I valori possibili sono 'iso8601' per selezionare il formato ISO 8601, o lasciarlo in bianco di modo che il formato venga desunto dalla lingua di default del browser. (''dalla 1.0'')
