Repository: rock-work/project-_trac
Catalog: trac/trac/locale/*/LC_MESSAGES/tracini.po
Languages: it

source: List of additional MIME types known by Pygments. For each, a tuple `mimetype:mode:quality` has to be specified, where `mimetype` is the MIME type, `mode` is the corresponding Pygments mode to be used for the conversion and `quality` is the quality ratio associated to this conversion. That can also be used to override the default quality ratio used by the Pygments render.
it: Lista di tipi MIME addizionali per Pygments. Ciascun tipo deve essere specificato da una tupla `mimetype:modo:qualità` dove `mimetype` è il tipo MIME, `modo` è il corrispondente modo che Pygments deve usare per la conversione e `qualità` è il grado di qualità associato alla conversione. È possibile in questo modo modificare il grado di qualità usato di default dal render di Pygments.

source: Name of the component implementing `IEmailSender`. This component is used by the notification system to send emails. Trac currently provides `SmtpEmailSender` for connecting to an SMTP server, and `SendmailEmailSender` for running a `sendmail`-compatible executable. (''since 0.12'')
it: Nome del componente che implementa `IEmailSender`. Questo componente viene usato dal sistema di notifiche per inviare i messaggi email. Attualmente Trac fornisce `SmtpEmailSender` per connettersi a un server SMTP e `SendmailEmailSender` per lanciare un eseguibile compatibile con `sendmail`. (''dalla 0.12'')

source: Enable email notification.
it: Abilita la notifica via email.

source: Sender address to use in notification emails. At least one of `smtp_from` and `smtp_replyto` must be set, otherwise Trac refuses to send notification mails.
it: Indirizzo del mittente usato nelle notifiche via email. Almeno una delle opzioni `smtp_from` e `smtp_replyto` deve essere impostata, altrimenti Trac si rifiuterà di inviare le notifiche via email.

source: Sender name to use in notification emails.
it: Nome del mittente nelle notifiche via email.

source: Use the author of the change as the sender in notification emails (e.g. reporter of a new ticket, author of a comment). If the author hasn't set an email address, `smtp_from` and `smtp_from_name` are used instead. (''since 1.0'')
it: Usa l'autore della modifica come mittente nelle notifiche via email (ad esempio il segnalatore di una nuova segnalazione oppure l'autore di un commento). Se l'autore non ha un indirizzo email verranno usate le opzioni `smtp_from` e `smtp_from_name`. (''dalla 1.0'')

source: Reply-To address to use in notification emails. At least one of `smtp_from` and `smtp_replyto` must be set, otherwise Trac refuses to send notification mails.
it: Indirizzo di Reply-To usato nelle notifiche via email. Almeno una delle opzioni `smtp_from` e `smtp_replyto` deve essere impostata, altrimenti Trac si rifiuterà di inviare le notifiche via email.

source: Comma-separated list of email addresses to always send notifications to. Addresses can be seen by all recipients (Cc:).
it: Indirizzi email, separati da virgole, a cui inviare sempre le notifiche via email, che sono visti da tutti i destinatari (Cc:).

source: Comma-separated list of email addresses to always send notifications to. Addresses are not public (Bcc:).
it: Indirizzi email, separati da virgole, a cui inviare sempre le notifiche via email, non visibili dai destinatari (Bcc:).

source: Default host/domain to append to addresses that do not specify one. Fully qualified addresses are not modified. The default domain is appended to all username/login for which an email address cannot be found in the user settings.
it: Host/domain di default da aggiungere agli indirizzi che ne sono sprovvisti. Gli indirizzi ''fully qualified'' non vengono modificati. Il dominio di default viene aggiunto ai nomi utente degli account che non abbiano specificato un indirizzo email nelle proprie impostazioni utente.

source: Comma-separated list of domains that should not be considered part of email addresses (for usernames with Kerberos domains).
it: Lista dei domini che non devono essere considerati parte del indirizzo email (per i nomi utente dei domini Kerberos), separati da virgole.

source: Comma-separated list of domains that should be considered as valid for email addresses (such as localdomain).
it: Lista dei domini che devono essere considerati come indirizzi email validi (tipo localdomain), separati da virgole.

source: Specifies the MIME encoding scheme for emails. Supported values are: `none`, the default value which uses 7-bit encoding if the text is plain ASCII or 8-bit otherwise. `base64`, which works with any kind of content but may cause some issues with touchy anti-spam/anti-virus engine. `qp` or `quoted-printable`, which works best for european languages (more compact than base64) if 8-bit encoding cannot be used.
it: Specifica la codifica MIME usata per le email. I valori supportati sono: `none`, il valore di default che utilizza la codifica 7-bit se il testo è completamente ASCII, altrimenti 8-bit. `base64` che funziona con qualsiasi tipo di contenuto ma può causare qualche problema con motori anti-spam/anti-virus puntigliosi. `qp` oppure `quoted-printable`, ottimale per le lingue europee (più compatto del base64) se la codifica 8-bit non può essere usata.

source: Addresses in the To and Cc fields are visible to all recipients. If this option is disabled, recipients are put in the Bcc list.
it: Gli indirizzi email sono visibili a tutti i destinatari. Se questa opzione è disabilitata, i destinatari vengono messi nel campo Bcc.

source: Permit email address without a host/domain (i.e. username only). The SMTP server should accept those addresses, and either append a FQDN or use local delivery. See also `smtp_default_domain`. Do not use this option with a public SMTP server.
it: Consenti indirizzi email senza un host/domain (cioè, solo nome utente). Il server SMTP dovrà accettare questi indirizzi, aggiungendovi un FQDN oppure usando la spedizione locale. Vedi anche `smtp_default_domain`. Non utilizzare questa opzione con un server SMTP pubblico.

source: Text to prepend to subject line of notification emails. If the setting is not defined, then `[$project_name]` is used as the prefix. If no prefix is desired, then specifying an empty option will disable it.
it: Testo da aggiungere in testa all'oggetto delle notifiche via email. Se non viene definito, verrà usato [$nome_progetto] come prefisso. Se non si desidera alcun prefisso, specificare un valore vuoto.

source: SMTP server hostname to use for email notifications.
it: Hostname del server SMTP da usare per le notifiche via email.

source: SMTP server port to use for email notification.
it: Numero di porta del server SMTP da usare per le notifiche via email.

source: Username for authenticating with SMTP server.
it: Username per l'autenticazione sul server SMTP.

source: Password for authenticating with SMTP server.
it: Password per l'autenticazione sul server SMTP.

source: Use SSL/TLS to send notifications over SMTP.
it: Usa SSL/TLS per spedire le notifiche tramite SMTP.

source: Path to the sendmail executable. The sendmail program must accept the `-i` and `-f` options. (''since 0.12'')
it: Percorso dell'eseguibile sendmail. Il programma sendmail deve accettare le opzioni `-i` e `-f`. (''dalla 0.12'')

source: Minimum length of query string allowed when performing a search.
it: Lunghezza minima della stringa di query quando si effettua una ricerca.

source: Specifies which search filters should be disabled by default on the search page. This will also restrict the filters for the quick search function. The filter names defined by default components are: `wiki`, `ticket`, `milestone` and `changeset`. For plugins, look for their implementation of the ISearchSource interface, in the `get_search_filters()` method, the first member of returned tuple. Once disabled, search filters can still be manually enabled by the user on the search page. (''since 0.12'')
it: Specifica quali filtri di ricerca debbano essere disabilitati di default sulla pagina di ricerca. Questo limita anche i filtri per la funzione di ricerca veloce. I nomi dei filtri definiti dai componenti di default sono: `wiki`, `ticket`, `milestone` e `changeset`. Per i plugin, controlla la loro implementazione dell'interfaccia ISearchSource, nel metodo `get_search_filters()`, il primo elemento della tupla ritornata. Una volta disabilitati, tali filtri potranno essere comunque riabilitati manualmente dall'utente sulla pagina di ricerca. (''dalla 0.12'')

source: In this section, you can define additional fields for tickets. See TracTicketsCustomFields for more details.
it: In questa sezione possono essere specificati campi addizionali per le segnalazioni. Vedi TracTicketsCustomFields per ulteriori dettagli.

source: Ordered list of workflow controllers to use for ticket actions.
it: Lista ordinata dei controlli del flusso di lavoro da usare nelle azioni sulle segnalazioni.

source: Make the owner field of tickets use a drop-down menu. Be sure to understand the performance implications before activating this option. See [TracTickets#Assign-toasDrop-DownList Assign-to as Drop-Down List]. Please note that e-mail addresses are '''not''' obfuscated in the resulting drop-down menu, so this option should not be used if e-mail addresses must remain protected.
it: Usa un menu a discesa per il campo `incaricato` delle segnalazioni. Assicurati di comprendere le implicazioni sulle performance prima di attivare questa opzione. Vedi [TracTickets#Assign-toasDrop-DownList Assign-to as Drop-Down List]. Nota che gli indirizzi email '''non''' vengono offuscati nel menu, quindi questa opzione non deve essere usata se gli indirizzi email devono rimanere protetti.

source: Default version for newly created tickets.
it: Versione di default da usare alla creazione di una nuova segnalazione.

source: Default type for newly created tickets.
it: Tipo di default da usare alla creazione di una nuova segnalazione.

source: Default priority for newly created tickets.
it: Priorità di default da usare alla creazione di una nuova segnalazione.

source: Default milestone for newly created tickets.
it: Obiettivo di default da usare alla creazione di una nuova segnalazione.

source: Default component for newly created tickets.
it: Componente di default da usare alla creazione di una nuova segnalazione.

source: Default severity for newly created tickets.
it: Severità di default da usare alla creazione di una nuova segnalazione.

source: Default summary (title) for newly created tickets.
it: Sommario (titolo) di default da usare alla creazione di una nuova segnalazione.

source: Default description for newly created tickets.
it: Descrizione di default da usare alla creazione di una nuova segnalazione.

source: Default keywords for newly created tickets.
it: Parole chiave di default da usare alla creazione di una nuova segnalazione.

source: Default owner for newly created tickets.
it: Incaricato di default da usare alla creazione di una nuova segnalazione.

source: Default cc: list for newly created tickets.
it: CC: di default usato alla creazione di nuove segnalazioni.

source: Default resolution for resolving (closing) tickets.
it: Risoluzione di default usata per risolvere (chiudere) le segnalazioni.

source: Comma-separated list of `select` fields that can have an empty value. (//since 1.1.2//)
it: Lista dei nomi dei campi, separati da virgole, che consentono un valore vuoto. (''dalla 1.1.2'')

source: The workflow for tickets is controlled by plugins. By default, there's only a `ConfigurableTicketWorkflow` component in charge. That component allows the workflow to be configured via this section in the `trac.ini` file. See TracWorkflow for more details.
it: Il flusso di lavoro delle segnalazioni è determinato dai plugin. Di default, c'è un solo componente `ConfigurableTicketWorkflow` che si occupa della gestione. Questo componente consente di configurare il flusso di lavoro in questa sezione del file `trac.ini`. Consulta TracWorkflow per ulteriori dettagli.

source: A Genshi text template snippet used to get the notification subject. The template variables are documented on the [TracNotification#Customizingthee-mailsubject TracNotification] page.
it: Frammento di template Genshi usato per generare l'oggetto della notifica. Le variabili del template sono documentate sulla pagina [TracNotification#Customizingthee-mailsubject TracNotification].

source: Like `ticket_subject_template` but for batch modifications. (''since 1.0'')
it: Come `ticket_subject_template` ma per le modifiche batch. (''dalla 1.0'')

source: Width of ambiguous characters that should be used in the table of the notification mail. If `single`, the same width as characters in US-ASCII. This is expected by most users. If `double`, twice the width of US-ASCII characters. This is expected by CJK users. (''since 0.12.2'')
it: Ampiezza dei caratteri ambigui utilizzata nelle tabelle incluse nelle notifiche via email. Se `single` viene usata la stessa ampiezza dei caratteri US-ASCII, scelta adatta per la maggior parte degli utenti. Se `double`, viene usata un'ampiezza doppia rispetto ai caratteri US-ASCII, adatta in particolare agli utenti CJK. (''dalla 0.12.2'')

source: The default query for authenticated users. The query is either in [TracQuery#QueryLanguage query language] syntax, or a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links].
it: La query di default per gli utenti autenticati. La query può essere nella sintassi specificata dal [TracQuery#QueryLanguage query language], oppure una stringa URL di query che comincia con il carattere `?` come utilizzata da `query:` [TracQuery#UsingTracLinks Trac links].

source: The default query for anonymous users. The query is either in [TracQuery#QueryLanguage query language] syntax, or a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links].
it: La query di default per gli utenti anonimy. La query può essere nella sintassi specificata dal [TracQuery#QueryLanguage query language], oppure una stringa URL di query che comincia con il carattere `?` come utilizzata da `query:` [TracQuery#UsingTracLinks Trac links].

source: Number of tickets displayed per page in ticket queries, by default.
it: Numero di segnalazioni per pagina mostrate di default nelle ricerce sulle segnalazioni.

source: Number of tickets displayed per page in ticket reports, by default.
it: Numero di segnalazioni per pagina mostrate di default nei report.

source: Number of tickets displayed in the rss feeds for reports.
it: Numero di segnalazioni mostrate nel flusso RSS.

source: As the workflow for tickets is now configurable, there can be many ticket states, and simply displaying closed tickets vs. all the others is maybe not appropriate in all cases. This section enables one to easily create ''groups'' of states that will be shown in different colors in the milestone progress bar. Note that the groups can only be based on the ticket //status//, nothing else. In particular, it's not possible to distinguish between different closed tickets based on the //resolution//. Example configuration with three groups, //closed//, //new// and //active// (the default only has closed and active): {{{ # the 'closed' group correspond to the 'closed' tickets closed = closed # .order: sequence number in the progress bar closed.order = 0 # .query_args: optional parameters for the corresponding # query. In this example, the changes from the # default are two additional columns ('created' and # 'modified'), and sorting is done on 'created'. closed.query_args = group=resolution,order=time,col=id,col=summary,col=owner,col=type,col=priority,col=component,col=severity,col=time,col=changetime # .overall_completion: indicates groups that count for overall # completion percentage closed.overall_completion = true new = new new.order = 1 new.css_class = new new.label = new # Note: one catch-all group for other statuses is allowed active = * active.order = 2 # .css_class: CSS class for this interval active.css_class = open # .label: displayed label for this group active.label = in progress }}} The definition consists in a comma-separated list of accepted status. Also, '*' means any status and could be used to associate all remaining states to one catch-all group. The CSS class can be one of: new (yellow), open (no color) or closed (green). Other styles can easily be added using custom CSS rule: `table.progress td.<class> { background: <color> }` to a [TracInterfaceCustomization#SiteAppearance site/style.css] file for example.
it: Dal momento che i flussi di lavoro per le segnalazioni sono configurabili, ci possono essere molti stati e quindi mostrare semplicemente le segnalazioni chiuse piuttosto che tutte le altre potrebbe non essere appropriato in molti casi. Questa sezione consente di creare dei ''gruppi'' di stati che saranno mostrati in colori diversi nelle barre di progresso della vista obiettivi. Nota che le segnalazioni possono essere raggruppate unicamente in base al loro //stato//, nient'altro. In particolare, non è possibile distinguere le segnalazioni chiuse in base alla //risoluzione//. Esempio di configurazione con tre gruppi, //chiuse//, //nuove// e //attive// (di default ci sono solo closed e active): {{{ # il gruppo 'chiuse' corrisponde alle segnalazioni 'closed' chiuse = closed # .order: ordine di presentazione nella barra di progresso chiuse.order = 0 # .query_args: parametri opzionali per la query corrispondente. # In questo esempio, rispetto al default ci sono due # ulteriori colonne ('created' e 'modified'), e # l'ordinamento viene effettuato su 'created'. chiuse.query_args = group=resolution,order=time,col=id,col=summary,col=owner,col=type,col=priority,col=component,col=severity,col=time,col=changetime # .overall_completion: indica i gruppi che incidono sulla percentuale # di completamento chiuse.overall_completion = true nuove = new nuove.order = 1 nuove.css_class = new nuove.label = nuove # Nota: è consentito avere un gruppo che includa tutti gli stati # non ancora considerati attive = * attive.order = 2 # .css_class: classe CSS per questo intervallo attive.css_class = open # .label: etichetta per questo gruppo attive.label = in lavorazione }}} La definizione consiste in una lista di stati separati da virgole. Inoltre, '*' indica uno stato qualsiasi e può essere usato per associare i rimanenti stati in un unico gruppo. La classe CSS può essere una delle seguenti: `new` (giallo), `open` (nessun colore) oppure `closed` (green). Ulteriori stili possono essere facilmente aggiunti con delle regole CSS personalizzate: `table.progress td.<class> { background: <color> }` inserite ad esempio nel file [TracInterfaceCustomization#SiteAppearance site/style.css].

source: Name of the component implementing `ITicketGroupStatsProvider`, which is used to collect statistics on groups of tickets for display in the roadmap views.
it: Nome del componente che implementa `ITicketGroupStatsProvider`, che viene usato per raccogliere le statistiche sui gruppi di segnalazioni per la visualizzazione nelle viste degli obiettivi.

source: Name of the component implementing `ITicketGroupStatsProvider`, which is used to collect statistics on groups of tickets for display in the milestone views.
it: Nome del componente che implementa `ITicketGroupStatsProvider`, che viene usato per raccogliere le statistiche sui gruppi di segnalazioni per la visualizzazione nelle viste degli obiettivi.

source: Default milestone to which tickets are retargeted when closing or deleting a milestone. (''since 1.1.2'')
it: Obiettivo di default dove spostare le segnalazioni quando l'obiettivo viene chiuso o cancellato. (''dalla 1.1.2'')

source: Default field to use for grouping tickets in the grouped progress bar. (''since 1.2'')
it: Campo usato di default per raggruppare le segnalazioni nella barra di progressione. (''dalla 1.2'')

source: Enable the display of all ticket changes in the timeline, not only open / close operations.
it: Abilita la visualizzazione di tutte le modifiche alle segnalazioni nella cronologia, non solo le operazioni di apertura / chiusura.

source: Enable the display of component of tickets in the timeline. (''since 1.1.1'')
it: Abilita la visualizzazione del componente delle segnalazioni nella cronologia. (''dalla 1.1.1'')

source: Maximum allowed description size in characters.
it: Dimensione massima consentita della descrizione, in caratteri.

source: Maximum allowed comment size in characters.
it: Dimensione massima consentita dei commenti, in caratteri.

source: Maximum allowed summary size in characters. (//since 1.0.2//)
it: Dimensione massima consentita del sommario, in caratteri. (''dalla 1.0.2'')

source: Which formatter flavor (e.g. 'html' or 'oneliner') should be used when presenting the description for new tickets. If 'oneliner', the [timeline] abbreviated_messages option applies.
it: Quale tipo di formattatore (cioè 'html' o 'oneliner') deve essere utilizzato per mostrare la descrizione delle nuove segnalazioni. Quando è impostato a 'oneliner', viene usata l'opzione [timeline] abbreviated_messages.

source: Whether Wiki formatter should respect the new lines present in the Wiki text. If set to 'default', this is equivalent to 'yes' for new environments but keeps the old behavior for upgraded environments (i.e. 'no').
it: Se il formattatore Wiki debba rispettare gli a-capo presenti nel testo Wiki. Se impostato a 'default', è equivalente a 'yes' per i nuovi ambienti mentre viene mantenuto il comportamento precedente negli ambienti che sono stati aggiornati (cioè 'no').

source: The base query to be used when linkifying values of ticket fields. The query is a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links]. (''since 0.12'')
it: La query di base usata quando i valori dei campi delle segnalazioni vengono trasformati in collegamenti. La stringa di query deve cominciare con il carattere `?` come utilizzata da `query:` [TracQuery#UsingTracLinks Trac links]. (''dalla 0.12'')

source: Default number of days displayed in the Timeline, in days.
it: Numero di giorni mostrati di default nella cronologia.

source: Maximum number of days (-1 for unlimited) displayable in the Timeline.
it: Numero massimo di giorni (-1 per illimitato) visualizzabile nella cronologia.

source: Whether wiki-formatted event messages should be truncated or not. This only affects the default rendering, and can be overriden by specific event providers, see their own documentation.
it: Se i messaggi di evento di tipo wiki debbano essere troncati oppure no. Questo influisce solo sulla resa di default e può essere modificato da specifici fornitori di eventi, consulta la loro documentazione.

source: Comma-separated list of allowed prefixes for repository directories when adding and editing repositories in the repository admin panel. If the list is empty, all repository directories are allowed. (''since 0.12.1'')
it: Lista di prefissi consentiti per le directory dei repository, separati da virgole, quando si aggiunge o si modificano i repository nel pannello di amministrazione. Se la lista è vuota, tutte le directory sono consentite. (''dalla 0.12.1'')
